
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("ВидДокумента", 
		ПредопределенноеЗначение("Перечисление.ВидДокументаПродажиИПроизводство.Продажи"));
	ОткрытьФорму("Документ.ОтчетОПродажахИПроизводстве.Форма.ФормаДокумента.", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти