
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокГрупп
&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановкаОтбораПоРодителю", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановкаОтбораПоРодителю()
	Данные = Элементы.СписокГрупп.ТекущиеДанные;
	Если Данные = Неопределено Тогда
		РаботаСоСпискамиИТаблицамиКлиент.УстановитьОтбор(Список, "Родитель", , , Ложь);
	Иначе
		РаботаСоСпискамиИТаблицамиКлиент.УстановитьОтбор(Список, "Родитель",
			ВидСравненияКомпоновкиДанных.Равно, Данные.Ссылка, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


