#Область ПрограммныйИнтерфейс

// Добавляет Отбор в настройки динамического списка. 
//
//Параметры:
//	Список - ДинамическийСписок
//	ЛевоеЗначение - Строка - имя поля, по которому устанавливается отбор
//	ВидСравнения - ВидСравненияКомпоновкиДанных  
//	ПравоеЗначение - Произвольный
//	Использование - Булево
//
Процедура УстановитьОтбор(Список, ЛевоеЗначение, ВидСравнения, ПравоеЗначение, Использование=Истина) Экспорт
	
	Перем НастройкиОтбора, ОтборПоПометкаУдаления, ПолеОтбора, ТипЭлемента, ЭлементОтбора;
	
	НастройкиОтбора = Список.КомпоновщикНастроек.Настройки.Отбор;
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ЛевоеЗначение); 
	ТипЭлемента = Тип("ЭлементОтбораКомпоновкиДанных");
	
	// Ищем отбор
	ОтборПоПометкаУдаления = Неопределено;
	Для Каждого ЭлементОтбора Из НастройкиОтбора.Элементы Цикл 
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора Тогда
			ОтборПоПометкаУдаления = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// ... если не нашли и планируем использовать - создаем
	Если ОтборПоПометкаУдаления = Неопределено И Использование Тогда
		ОтборПоПометкаУдаления = НастройкиОтбора.Элементы.Добавить(ТипЭлемента);
		ОтборПоПометкаУдаления.ЛевоеЗначение = ПолеОтбора;
		ОтборПоПометкаУдаления.ВидСравнения = ВидСравнения;
		ОтборПоПометкаУдаления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;                                                                                                 
	
	// Устанавливаем правое значение и использование для существующего отбора
	Если ОтборПоПометкаУдаления <> Неопределено Тогда
		ОтборПоПометкаУдаления.ПравоеЗначение = ПравоеЗначение;
		ОтборПоПометкаУдаления.Использование = Использование; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

