
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    Отбор = Новый Структура("ВидДокумента", 
    	ПредопределенноеЗначение("Перечисление.ВидДокументаПродажиИПроизводство.Продажи"));

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("Документ.ОтчетОПродажахИПроизводстве.ФормаСписка", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, "ЭтоСписокОтчетовПоПродажам",
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти