
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    Отбор = Новый Структура("ВидДокумента", 
    	ПредопределенноеЗначение("Перечисление.ВидДокументаПродажиИПроизводство.Производство"));

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("Документ.ОтчетОПродажахИПроизводстве.ФормаСписка.", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, "ЭтоСписокОтчетовПоПроизводству",
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти